Tekla Open API Reference for Tekla Structures 2025
SurfaceTreatment.Material Property
 Defines the material for the surface treatment.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Material Material { get; set; }
Public Property Material As Material
	Get
	Set
Property Value
Type: Material
See Also
Reference
SurfaceTreatment Class
Tekla.Structures.Model Namespace